package com.example.levhazahav;

import androidx.annotation.NonNull;
import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.MenuItem;
import android.view.View;
import android.widget.Button;
import android.widget.ExpandableListAdapter;
import android.widget.ExpandableListView;
import android.widget.Toast;

import com.google.android.material.bottomnavigation.BottomNavigationView;
import com.google.android.material.navigation.NavigationBarView;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

public class activity_info extends AppCompatActivity implements View.OnClickListener {


    BottomNavigationView nav;
    List<String> groupList1,groupList2,groupList3,groupList4;
    List<String> childList1,childList2,childList3,childList4;
    Map<String, List<String>> QuestionCollection1,QuestionCollection2,QuestionCollection3,QuestionCollection4;
    ExpandableListView expandableListView;
    ExpandableListAdapter expandableListAdapter;
    Button btnInfo1, btnInfo2, btnInfo3, btnInfo4;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_info);

        nav = findViewById(R.id.bottom_navigation);
        btnInfo1 = findViewById(R.id.btnInfo1);
        btnInfo2 = findViewById(R.id.btnInfo2);
        btnInfo3 = findViewById(R.id.btnInfo3);
        btnInfo4 = findViewById(R.id.btnInfo4);



        btnInfo1.setOnClickListener(this);
        btnInfo2.setOnClickListener(this);
        btnInfo3.setOnClickListener(this);
        btnInfo4.setOnClickListener(this);

        nav.setSelectedItemId(R.id.info);


        nav.setOnItemSelectedListener(new NavigationBarView.OnItemSelectedListener() {
            @Override
            public boolean onNavigationItemSelected(@NonNull MenuItem item) {

                switch (item.getItemId()) {


                    case R.id.home:
                        startActivity(new Intent(getApplicationContext(), MainActivity.class));
                        overridePendingTransition(0, 0);
                        return true;

                    case R.id.classify:
                        startActivity(new Intent(getApplicationContext(), activity_classify.class));
                        overridePendingTransition(0, 0);
                        return true;

                    case R.id.search:
                        startActivity(new Intent(getApplicationContext(), activity_search.class));
                        overridePendingTransition(0, 0);
                        return true;

                    case R.id.info:
                        return true;

                }


                return false;
            }
        });


    }

    private void createGroupList1() {
        groupList1 = new ArrayList<>();
        groupList1.add("אילו סוגי בתי אבות קיימים?");
        groupList1.add("מי הגורם המפקח על בתי האבות?");
        groupList1.add("מי ממן את המגורים במסגרת?");

    }
    private void createGroupList2() {
        groupList2 = new ArrayList<>();
        groupList2.add("כיצד נקבע סוג בית אבות לדייר המיועד?");
        groupList2.add("כיצד מומלץ לבחור הבית אבות מתאים לדייר המיועד");
        groupList2.add("מהו הליך השמת אזרח ותיק בבית אבות");

    }

    private void createGroupList3() {
        groupList3 = new ArrayList<>();
        groupList3.add("סיוע במימון מגורים בבית אבות");
        groupList3.add("אילו מסמכים יש להגיש לקבלת סיוע?");
        groupList3.add("כיצד מתבצע חישוב זכאות?");
        groupList3.add("האם גם הילדים של האזרח הוותיק משתתפים בהחזקתו בבית האבות?");
        groupList3.add("האם ניתן לערער על גובה התשלום ולקבל הנחות מיוחדות?");

    }

    private void createGroupList4() {
        groupList4 = new ArrayList<>();
        groupList4.add("אילו שירותים בריאותיים ניתנים לדיירים בבית האבות?");
        groupList4.add("כיצד מתבצע מעקב בריאותי אחר המתגוררים בבית האבות?");
        groupList4.add("האם משפחתו של הדייר מקבלת עדכון לגבי מצבו הרפואי?");
        groupList4.add("מה קורה כאשר דייר בבית אבות נדרש לאשפוז בבית חולים?");
        groupList4.add("האם קיים פיקוח על תחום הבריאות בבית האבות?");

    }

    private void createCollection1() {

        String[] questions1g1 = {"ישנם בישראל מספר סוגים של בתי אבות, הנבדלים זה מזה במאפייני האוכלוסייה המתגוררת בהם ובצורכיה.בעת קבלת ההחלטה על מעבר לבית אבות, ייקבע סוג המעון המתאים על פי הגדרת התפקוד של הדייר המיועד.הגדרות התפקוד מחולקות ל-4 קבוצות:בתי אבות לאזרחים ותיקים עצמאיים או תשושים.בתי אבות לאזרחים ותיקים סיעודיים." +
                "בתי אבות לאזרחים ותיקים תשושי נפש." +
                "בתי אבות לאזרחים ותיקים סיעודיים מורכבים"};

        String[] questions2g1 ={"בתי האבות לעצמאים או תשושים נמצאים בפיקוח של משרד הרווחה והביטחון החברתי.\n" +
                "\n" +
                "בתי אבות ומחלקות לאזרחים ותיקים סיעודיים נמצאים בפיקוח של משרד הבריאות.\n" +
                "בתי אבות ומחלקות לתשושי נפש נמצאים בפיקוח משרד הבריאות.\n" +
                "\n" +
                "בתי אבות ומחלקות אלו נמצאים בפיקוח משרד הבריאות ומופעלים על ידי קופות החולים, עם השתתפות עצמית של האזרח.\n"};

        String[] questions3g1 ={"בתי האבות לעצמאים או תשושים- משרד הרווחה והביטחון החברתי משתתף, באמצעות לשכות הרווחה ברחבי הארץ, במימון עלות האחזקה החודשית לאזרחים ותיקים שאינם יכולים לממן את מלוא עלות האחזקה מהכנסותיהם, בבתי אבות שאושרו על ידי המשרד.\n" +
                "\n" +
                "בתי אבות ומחלקות לאזרחים ותיקים סיעודיים-\u2028משרד הבריאות משתתף בעלויות האחזקה של אזרחים ותיקים שאינם יכולים לממן את מלוא העלות, וזאת באמצעות מתן קוד בהתאם למבחן זכאות שלוקח בחשבון את כלל הכנסותיהם.\n"};

        QuestionCollection1 = new HashMap<String , List<String>>();
        for(String group : groupList1){

            if(group.equals("אילו סוגי בתי אבות קיימים?")){
                loadChild1(questions1g1);
            }
            else if (group.equals("מי הגורם המפקח על בתי האבות?")){
                loadChild1(questions2g1);
            }
            else if (group.equals("מי ממן את המגורים במסגרת?")){
                loadChild1(questions3g1);
            }
        }


    }

    private void loadChild1(String[] questions) {

        childList1 = new ArrayList<>();
        for(String question : questions){

            childList1.add(question);
        }



    }

    private void createCollection2() {

        String[] questions1g2 ={"סוג בית האבות המתאים ייקבע על פי הגדרת התפקוד של הדייר המיועד.\n" +
                "\n" +
                "הגדרת התפקוד של אזרח ותיק המיועד למגורים בבית אבות נקבעת על פי בדיקה הנערכת בקופת החולים.\n" +
                "במהלך הבדיקה תמלא האחות דוח תפקודי המשקף את רמת תפקודו של האזרח הוותיק המעוניין להיכנס לבית אבות, וכך יקבע הסטטוס התפקודי.\n" +
                "\n" +
                "במקרים שבהם רמת התפקוד לא ברורה, יש לפנות לרופא הגריאטרי המחוזי של משרד הבריאות לקביעת הסטטוס התפקודי."};

        String[] questions2g2 ={"בעת הבחירה בבית האבות המתאים יש להתחשב בשיקולים הבאים:\n" +
                "\n" +
                "התאמת המבנה החברתי של אוכלוסיית בית האבות לדייר המיועד;\n" +
                "התאמת מבנה בית האבות והשירותים הניתנים בו למצבו התפקודי-רפואי של הדייר המיועד;\n" +
                "במקרה של בני זוג ברמות תפקוד שונות המעוניינים להתגורר בבית אבות, יש להתמקד בבחירה מתוך בתי אבות משולבים."};

        String[] questions3g2 ={"הליך השמת אזרח ותיק בבית אבות מורכב ממספר שלבים:\n" +
                "\n" +
                "העברת מידע לבית האבות:\n" +
                "לאחר קבלת ההחלטה על בית האבות הנבחר, מעבירה המחלקה לשירותים חברתיים לבית האבות מידע רפואי-סיעודי ודו\"ח סוציאלי למתן שירותים לזקן.\n" +
                " \n" +
                "קיום ועדת קבלה:\n" +
                "עם קבלת החומר, מתקיימת בבית האבות ועדת קבלה שחבריה הם מנהל או מנהלת בית האבות, אח או אחות רפואית, עובד או עובדת סוציאלית ורופא או רופאה.\n" +
                "חברי הוועדה יקבעו האם לאשר או לדחות את קבלת הדייר המיועד לבית האבות.\n" +
                " \n" +
                "העברת התשובה לדייר המיועד.\n" +
                "אם הוחלט לאשר את קבלתו של הדייר המיועד, תפעל מחלקת הרווחה ברשות המקומית באופן הבא:\n" +
                "\n" +
                "קבלת הסכמת הדייר המיועד בכתב, לאחר שביקר בבית האבות;\n" +
                "הסדרת העניינים הכספיים. \u2028\n" +
                "חשוב לציין:\n" +
                "שלושת החודשים הראשונים של האזרח הוותיק בבית האבות משמשים כתקופת ניסיון;\n" +
                "אם נדחתה בקשת הדייר המיועד לקבלה לבית האבות, על העובד או העובדת הסוציאלית במחלקה לשירותים חברתיים להציע לאזרח הוותיק מקום אחר. "};

    }


    private void createCollection3() {

        String[] questions1g3 ={"אזרחים ותיקים הזכאים לסיוע בתשלום עבור המגורים רשאים לבחור בית אבות מתוך רשימת מעונות שזכו במכרז של משרד הרווחה והביטחון החברתי. \n" +
                "מעונות אלו מורשים לקלוט אזרחים ותיקים הזכאים לסיוע ממשלתי במימון עבור המגורים במקום.\n" +
                "\n" +
                "גובה הסיוע נקבע בהליך חישוב זכאות המתבצע על ידי המחלקה לשירותים חברתיים, בהתחשב ביכולות הכספיות של האזרח הוותיק ובני משפחתו."};

        String[] questions2g3 ={"אזרח ותיק המבקש סיוע ממשלתי במימון עבור מגורים במעון, נדרש להעביר את המסמכים הבאים:\n" +
                "\n" +
                "צילום תעודת זהות;\n" +
                "טופס תפקודי מעודכן, ממולא על ידי אחות ורופא המשפחה, וכל מסמך רפואי רלוונטי נוסף;\n" +
                "אישור הכנסות מהביטוח הלאומי;\n" +
                "שלושת תלושי הפנסיה האחרונים של הפונה (אם מקבל פנסיה);\n" +
                "דף חשבון בנק של הפונה (שלושה חודשים אחרונים);\n" +
                "אישורי הכנסה של כל אחד מילדיו של הפונה (שלושה חודשים אחרונים) וצילום תעודות הזהות שלהם;\n" +
                "אישורים על דירת הפונה:\n" +
                "במקרה של דירה פרטית יש להגיש נסח טאבו והערכת שמאי;\n" +
                "במקרה של דירה בדמי מפתח יש להגיש חוזה שכירות מוגנת, קבלות על שכר דירה, הערכת שמאי ונסח טאבו;\n" +
                "במקרה של דירה בשכירות פרטית או ציבורית, יש להגיש חוזה שכירות ותצהיר מעורך דין או נוטריון שאין לפונה נדל\"ן נוסף."};

        String[] questions3g3 ={"על מנת לקבוע את גובה הסיוע במימון המגורים בבית האבות, יבוצע חישוב זכאות על פי המקורות הכספיים של האזרח הוותיק:\n" +
                "\n" +
                "חישוב זה יכלול את קצבת הביטוח הלאומי, הכנסות מעבודה, פנסיה, גמלאות, חסכונות והכנסות מנכס;\n" +
                "מתבצע פיצול קצבה של קצבאות ביטוח לאומי.\n" +
                "למעט דמי כיס, שאר הקצבה עובר לרשות המקומית לצורך מימון המגורים בבית האבות;\n" +
                "תגמולים לניצולי שואה אינם כלולים בחישוב;\n" +
                "לכל דייר אשר שוכן במעון יישאר סכום לדמי כיס לשימושו הפרטי;\n" +
                "במקרים בהם לאזרח הוותיק ישנם בני משפחה התלויים בו (בן או בת זוג הממשיכים להתגורר בבית, ילדים עם צרכים מיוחדים וכדומה), יישאר בידי בני המשפחה סכומים המספקים לצורכיהם.\n" +
                "אופן החישוב מפורט בתקנון ותעריפים 4.8.\n" +
                "\n"};
        String[] questions4g3 ={"כאשר מקורותיו של האזרח הוותיק אינם מספיקים להוצאות החזקתו בבית האבות, ישתתפו ילדיו בתשלום. \n" +
                "\n" +
                "עבור כל ילד ייעשה חישוב נפרד על סכום ההשתתפות אותו עליו לשלם.\n" +
                "החישוב ייעשה על פי הכנסותיו ברוטו ועל פי מספר הנפשות אותן הוא מפרנס.\n" +
                "לאחים ישנה אפשרות להגיע להסדר ביניהם.\n" +
                " \n" +
                "במשק בית של אדם אחד, ייעשה חישוב ההשתתפות לפי שתי נפשות;\n" +
                "במשק בית של שתי נפשות, ייעשה חישוב ההשתתפות לפי שלוש נפשות. "};

        String[] questions5g3 ={"כאשר האזרח הוותיק וילדיו אינם יכולים לשאת בתשלום על המגורים בבית האבות, ניתן לפנות בנושא אל ועדת חריגים במחוז אליו משתייך האזרח הוותיק.\n" +
                "בעת שקילת הבקשה, תתחשב הוועדה במקרים הבאים:\n" +
                "\n" +
                "משפחה של אזרח ותיק אשר יש לה הוצאות מיוחדות (לדוגמה: מחלות ובעיות רפואיות ותפקודיות של אחד מבני המשפחה);\n" +
                "ילדיו של האזרח הוותיק עלו לארץ בחמש השנים האחרונות או שהם תושבים חוזרים;\n" +
                "ילדיו של אזרח ותיק אשר אינם בקשר אתו (יש צורך בחוות דעת העובד הסוציאלי המטפל)."};
    }


    private void createCollection4() {

        String[] questions1g4 ={"הנהלת בית האבות אחראית כי לאזרחים הוותיקים המתגוררים במקום יינתנו שירותי הבריאות הבאים:\n" +
                "\n" +
                "טיפול רפואי שוטף על ידי רופא המעון בית האבות;\n" +
                "שירות עזרה ראשונה זמין 24 שעות ביממה. השירות יינתן על ידי עובד אשר עבר קורס עזרה ראשונה;\n" +
                "שירותי סיעוד וחלוקת תרופות;\n" +
                "טיפול אישי והיגיינה לדיירים הנזקקים לכך;\n" +
                "טיפולי פיזיותרפיה וריפוי בעיסוק בבית האבות או בקהילה, על פי הפניית רופא המעון;\n" +
                "טיפול על ידי מומחים בקהילה לפי הפניית רופא המעון בית האבות;\n" +
                "בדיקות רפואיות תקופתיות;\n" +
                "עזרים רפואיים לפי הצורך."};
        String[] questions2g4 ={"עם כניסתו של דייר לבית האבות תיקבע לו תוכנית טיפולית-סיעודית.\n" +
                "\n" +
                "במהלך המגורים במקום, תדאג הנהלת המקום שצוות הבריאות ינהל רשומה רפואית של הדייר, במחשב או בכתב, הכוללת תיעוד מלא של כלל הפעולות הרפואיות, הטיפולים, ההמלצות, ההחלטות, הבדיקות וכדומה, אשר התבצעו"};
        String[] questions3g4 ={"בכל שינוי משמעותי במצבו הרפואי של דייר, קיימת מחויבות של המסגרת לעדכן את המשפחה או האפוטרופוס לגבי המצב העדכני."};
        String[] questions4g4 ={"כאשר דייר בבית אבות נדרש להעברה לבית חולים ובהמשך לאשפוז, מוטלת על הנהלת בית האבות האחריות הבאה:\n" +
                "\n" +
                "לדאוג להבאת הדייר לבית החולים ולהחזרתו בסיום השהות לבית האבות. יש לדאוג לליווי אם צריך;\n" +
                "להודיע לבני משפחתו של הדייר על אשפוזו;\n" +
                "לקיים מעקב אחר הדייר בעת שהותו בבית החולים, על ידי אחות המעון בית האבות או העובד הסוציאלי של המעון בית האבות.\n" +
                "שימו לב:\n" +
                "\n" +
                "כאשר דייר בבית אבות מאושפז בבית חולים, יישמר לו מקומו בבית האבות בזמן אשפוזו ולמשך שלושה חודשים לפחות.\n" +
                "בזמן זה ישלם הדייר 90% מהתשלום החודשי הקבוע."};
        String[] questions5g4 ={"תחום הבריאות בבתי אבות מפוקח על ידי אח או אחות מטעם משרד הרווחה והביטחון החברתי.\n" +
                "\n" +
                "כל האזרחים נשארים חברי הקופות חולים שלהם ולכן זכאים לכל שירות מהקופה:\n" +
                "\n" +
                "תרופות\n" +
                "ללא תשלום פרט לתרופות שאינן בסל הבריאות;\n" +
                " \n" +
                "פינוי באמבולנס\n" +
                "בבתי אבות שבמכרז יעשה הפינוי על חשבון בית האבות; \n" +
                " \n" +
                "התייעצות מומחים במסגרת קופות החולים;\n" +
                " \n" +
                "טיפולים ובדיקות\n" +
                "טיפולים שניתן לעשות בבית האבות ייערכו בו.\n" +
                "כל טיפול או בדיקה אחרת תיערך בקופת החולים או בבית חולים;\n" +
                " \n" +
                "אביזרי עזר\n" +
                "ניתן להשתמש בציוד שקיים בכל בית אבות, יד שרה ועזר מציון.\n" +
                "ההתאמה נעשית במקום."};
    }



    @Override
    public void onClick(View view) {

        switch (view.getId()) {


            case R.id.btnSearchOpt1Q4:


        }
    }
}

